In [44]:
import pandas as pd 
import numpy as np

**Answer 1**

In [45]:
df = pd.read_excel("Real_estate Dataset.xlsx")          #Load the dataset
df.head(5)

  Property_ID   Location Property_Type      Price  Size_sqft  Bedrooms
0        P001     Mumbai         Villa  9000000.0     1136.0       2.0
1        P002    Chennai     Apartment  5400000.0     1828.0       NaN
2        P003  Hyderabad          Plot        NaN      897.0       3.0
3        P004      Delhi        Studio  7500000.0        NaN       2.0
4        P005      Delhi     Apartment  8900000.0     2906.0       2.0

In [46]:
df1 = df.copy()          #Creating a copy of dataset

**Answer 2**

In [47]:
df.isnull().sum()          #checking null values

Property_ID      0
Location         0
Property_Type    0
Price            7
Size_sqft        7
Bedrooms         7
dtype: int64

**Answer 3**

In [48]:
#finding mode of bedroom column
mode = df["Bedrooms"].mode()[0]
print("Mode:",mode)

Mode: 3.0

In [49]:
#Filling missing values in bedroom column with mode             
df['Bedrooms'].fillna(mode, inplace=True)

C:\Users\PC\AppData\Local\Temp\ipykernel_22396\3394376193.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Bedrooms'].fillna(mode, inplace=True)

In [50]:
#finding meadian of size_sqft 
median = df["Size_sqft"].median()
print("Median:", median)

Median: 1433.0

In [51]:
#filling missing values in this column with median
df["Size_sqft"] = df["Size_sqft"].fillna(median)

In [53]:
df.isnull().sum()

Property_ID      0
Location         0
Property_Type    0
Price            7
Size_sqft        0
Bedrooms         0
dtype: int64

**Answer 4**

In [ ]:
df.shape   #currently my dataset has 52 rows and 6 columns

(52, 6)

In [55]:
#dropping missing values in price column
df.dropna(subset=['Price'], inplace=True)

In [57]:
rows = len(df)
print("Remaining rows:",rows)     #after dropping null rows now i have 45 rows

Remaining rows: 45

**Answer 5**

In [61]:
duplicate_count = df.duplicated().sum()                  # Count duplicate  rows
print(f"Duplicate rows found: {duplicate_count}")

Duplicate rows found: 2

In [62]:
df = df.drop_duplicates()   #Removing duplicate rows

In [63]:
row = len(df)
print("Remaining rows:",row)

Remaining rows: 43

**Answer 6**

In [66]:
#PRICE
mean_price = df['Price'].mean()     # Average price
median_price = df['Price'].median() # Middle value when sorted
min_price = df['Price'].min()       # Lowest price
max_price = df['Price'].max()       # Highest price

print("Mean:", mean_price)
print("Median:", median_price)
print("Min:", min_price)
print("Max:", max_price)

Mean: 8223255.813953488
Median: 8200000.0
Min: 3500000.0
Max: 14900000.0

In [67]:
#size_sqft
mean_size = df['Size_sqft'].mean()            # Average Size
median_size = df['Size_sqft'].median()        # Middle value
min_size = df['Size_sqft'].min()              # Smallest property size
max_size = df['Size_sqft'].max()              # Largest property size

print("Mean:", mean_size)
print("Median:", median_size)
print("Min:", min_size)
print("Max:", max_size)

Mean: 1528.906976744186
Median: 1433.0
Min: 701.0
Max: 2906.0

**Answer 7**

In [70]:
city = ["Delhi", "Mumbai", "Bangalore"]              # Create a DataFrame with average property prices for selected cities
avg_price = [80, 120, 95]  # in lakhs
df_new = pd.DataFrame({
    "City": city,
    "Avg_Price(in lakhs)": avg_price
})

In [71]:
df_new

        City  Avg_Price(in lakhs)
0      Delhi                   80
1     Mumbai                  120
2  Bangalore                   95

**Answer 8**

In [72]:
# Filter properties located in Mumbai with more than 2 bedrooms
mumbai_properties = df[(df["Location"] == "Mumbai") & (df["Bedrooms"] > 2)]

# Display the result
print("Properties in Mumbai with more than 2 bedrooms:")
print(mumbai_properties)

Properties in Mumbai with more than 2 bedrooms:
   Property_ID Location Property_Type       Price  Size_sqft  Bedrooms
6         P007   Mumbai          Plot  11200000.0     2672.0       3.0
8         P009   Mumbai         Villa   7300000.0     1600.0       3.0
39        P040   Mumbai         Villa   3800000.0     2893.0       3.0
47        P048   Mumbai         Villa  14900000.0     1616.0       4.0

**Answer 9**

In [73]:
# Filter properties where Price > 1 crore
high_value_properties = df[df["Price"] > 10000000]

# Display the result
print("Properties with Price greater than 1 crore:")
print(high_value_properties)

Properties with Price greater than 1 crore:
   Property_ID   Location Property_Type       Price  Size_sqft  Bedrooms
6         P007     Mumbai          Plot  11200000.0     2672.0       3.0
13        P014  Hyderabad        Studio  14100000.0     1826.0       3.0
15        P016    Chennai         Villa  13900000.0     1150.0       3.0
19        P020    Chennai          Plot  13800000.0     1433.0       3.0
22        P023       Pune         Villa  14500000.0      808.0       3.0
25        P026    Chennai          Plot  13000000.0     1433.0       4.0
27        P028       Pune        Studio  12300000.0     1672.0       2.0
28        P029  Bangalore     Apartment  10100000.0     1433.0       4.0
40        P041    Chennai     Apartment  11600000.0     2264.0       2.0
46        P047    Chennai        Studio  10200000.0     2286.0       2.0
47        P048     Mumbai         Villa  14900000.0     1616.0       4.0
48        P049     Mumbai         Villa  11500000.0     1042.0       2.0

**Answer 10**

In [84]:
# Merge the main DataFrame (df) with the city_price_df
merged_df = pd.merge(df, df_new, left_on="Location", right_on="City", how="inner")
merged_df.head(5)

,Property_ID,Location,Property_Type,Price,Size_sqft,Bedrooms,City,Avg_Price(in lakhs)
0,P001,Mumbai,Villa,9000000.0,1136.0,2.0,Mumbai,120
1,P004,Delhi,Studio,7500000.0,1433.0,2.0,Delhi,80
2,P005,Delhi,Apartment,8900000.0,2906.0,2.0,Delhi,80
3,P006,Delhi,Apartment,3600000.0,900.0,3.0,Delhi,80
4,P007,Mumbai,Plot,11200000.0,2672.0,3.0,Mumbai,120

In [ ]:
merged_df["Price_vs_Avg"] = merged_df["Price"] - (merged_df["Avg_Price(in lakhs)"]) 
print(merged_df[["Location", "City", "Price", "Avg_Price(in lakhs)", "Price_vs_Avg"]].head())

  Location    City       Price  Avg_Price(in lakhs)  Price_vs_Avg
0   Mumbai  Mumbai   9000000.0                  120     8999880.0
1    Delhi   Delhi   7500000.0                   80     7499920.0
2    Delhi   Delhi   8900000.0                   80     8899920.0
3    Delhi   Delhi   3600000.0                   80     3599920.0
4   Mumbai  Mumbai  11200000.0                  120    11199880.0

**Answer 11**

In [89]:
avg_price_by_type = df.groupby('Property_Type')['Price'].mean()   # Average price by property type
print(avg_price_by_type)

Property_Type
Apartment    6.807143e+06
Plot         1.124000e+07
Studio       9.188889e+06
Villa        7.960000e+06
Name: Price, dtype: float64

**Answer 12**

In [90]:
df_sorted = df.sort_values(by='Price', ascending=False)   # Sort properties by price in descending order
print(df_sorted.head())

   Property_ID   Location Property_Type       Price  Size_sqft  Bedrooms
47        P048     Mumbai         Villa  14900000.0     1616.0       4.0
22        P023       Pune         Villa  14500000.0      808.0       3.0
13        P014  Hyderabad        Studio  14100000.0     1826.0       3.0
15        P016    Chennai         Villa  13900000.0     1150.0       3.0
19        P020    Chennai          Plot  13800000.0     1433.0       3.0